const messages = {
  successAction: 'Η ενέργεια πραγματοποιήθηκε επιτυχώς',
  errorAction: 'Παρουσιάστηκε σφάλμα κατά την πραγματοποιήση της συγκεκριμένης ενέργειας',
  errorCommunication: 'Παρουσιάστηκε σφάλμα κατά την επίκοινωνία με το διακομιστή. Παρακαλούμε επικοινωνήστε με το διαχειριστή του συστήματος για περισσότερες λεπτομέρειες.',
  errorUnauthorized: 'Δεν υπάρχει χρήστης συνδεδεμένος στην εφαρμογή! Παρακαλούμε συνδεθείτε και προσπαθήστε ξανά',
  errorForbidden: 'Δεν έχετε πρόσβαση στη συγκεκριμένη λειτουργία! Παρακαλούμε συνδεθείτε με διαφορετικό λογαριασμό χρήστη και προσπαθήστε ξανά',
  errorLoad: 'Παρουσιάστηκε σφάλμα κατά τη φόρτωση των δεδομένων',
  errorLogin: 'Λανθασμένη προσπάθεια σύνδεσης! Παρακαλούμε προσπαθήστε ξανά.',
  errorUnknown: 'Η εφαρμογή αντιμετώπισε άγνωστο σφάλμα!  Παρακαλούμε επικοινωνήστε με το διαχειριστή του συστήματος για περισσότερες λεπτομέρειες.',
  errorDuplicateRecord: 'Η εγγραφή αυτή υπάρχει ήδη στη βάση δεδομένων',
  errorDeleteDependencies: 'Η εγγραφή αυτή δεν μπορεί να διαγραφεί, καθώς έχει ήδη διασυνδεθεί με άλλες εγγραφές στη βάση',
  warningNoResultFound: 'Δεν βρέθηκαν αποτελέσματα για την αναζήτηση',
  confirmActionTitle: 'Επιβεβαίωση Ενέργειας',
  confirmAction: 'Η ενέργεια αυτή είναι αμετάκλητη. Θέλετε να συνεχίσετε?',
  selected: 'Επιλεγμένο',
  setSelection: 'Πιέστε Enter για επιλογή',
  removeSelection: 'Πιέστε Enter για αφαίρεση',
  typeToSearch: 'Πληκτρολογείστε για αναζήτηση',
  yes: 'Ναι',
  no: 'Όχι',
  ok: 'Οκ',
  warning: 'Προειδοποίηση',
  required: 'Το πεδίο δεν έχει συμπληρωθεί.',
  // DATA BASE ENTITIES
  Ingredients: 'Συστατικά',
  Ingredient: 'Συστατικό'
}

export default messages
